wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
#if defined(DONGLE) && defined(USES_DISPLAY)
void animTaskLink(void *pvParameters) {
  unsigned long lastChange = 0;
  int8_t currentIndex = 0;
  int8_t direzione = 1;
  const char* word = "Scanning WiFi (((o)))"; // Waiting link 
  const char* rotazione = "-\\|/-\\|/";
  int8_t rotazioneIndex = 0;
  const uint8_t baseX = 75;
  const uint8_t baseY = 58;
  const uint8_t charWidth = 6;
  uint8_t len_word = strlen(word);

  
  // Setup iniziale display
  //tft.setCursor(baseX, baseY);
  tft.setTextSize(1);
  tft.setTextColor(WHITE, BLACK);
  tft.fillRect(70,20,100,60,BLACK);
  ////////tft.fillRect(0, 0, 128, 16, BLACK);
  ////////tft.drawFastHLine(0, 15, 128, WHITE);
  tft.setCursor(baseX, baseY - 30);
  tft.print("Selected");
  tft.setCursor(baseX, baseY - 19);
  tft.print("channel:");
  tft.setCursor(baseX + (9 * charWidth)+3, baseY - 26);
  tft.setTextSize(2);
  tft.setTextColor(RED, BLACK);
  char buffer[10];
  sprintf(buffer, "%2d", espnow_wifi_channel);
  tft.print(buffer);
  tft.setTextSize(1);
  tft.setTextColor(WHITE, BLACK);
  tft.setCursor(baseX, baseY);
  tft.print("Connecting");
  tft.display();
  tft.setTextSize(2);
  tft.setTextColor(BLUE, BLACK);

  // Loop del task
  for (;;) {    
    tft.setCursor(baseX + (11 * charWidth) + 3, baseY);
    tft.write(rotazione[rotazioneIndex]);
    rotazioneIndex = (rotazioneIndex + 1) % 8;
    tft.display();
    vTaskDelay(pdMS_TO_TICKS(150)); // piccolo delay per non saturare la CPU
  } 
}
#endif // DONGLE


//////////////////////////////////////////////////////////////////

#if defined(DONGLE) && defined(USES_DISPLAY)
void animTask(void *pvParameters) {
  int8_t currentIndex = 0;
  const uint8_t baseX = 75;
  const uint8_t baseY = 45;
  const uint8_t charWidth = 6;

  // Setup iniziale display
  tft.setCursor(baseX, baseY);
  tft.setTextSize(1);
  tft.setTextColor(WHITE, BLACK);
  //tft.fillRect(0, 0, 128, 16, BLACK);
  //tft.drawFastHLine(0, 15, 128, WHITE);
  //tft.setTextColor(RED, BLACK);
  tft.setCursor(baseX + 12, baseY - 20);
  tft.print("Searching");
  tft.setCursor(baseX+3, baseY - 10);
  tft.print("best channel");
  //tft.setTextColor(BLUE, BLACK);
  tft.setCursor(baseX, baseY);
  tft.print("Scanning WiFi");
  tft.display();
  tft.setTextColor(BLUE, BLACK);

  //tft.setTextColor(WHITE, BLACK);
  // Loop del task
  for (;;) {  
    tft.setCursor(baseX + (3 * charWidth), baseY + 18);
    switch (currentIndex)
    {
    case 0:
      /* code */
      tft.print("   o   ");
      break;
    case 1:
      /* code */
      tft.print("  (o)  ");
      break;
    case 2:
      /* code */
      tft.print(" ((o)) ");
      break;
    case 3:
      /* code */
      tft.print("(((o)))");
      break;
    
    default:
      
    break;
    }
    currentIndex = (currentIndex + 1) % 4;
    tft.display();
    vTaskDelay(pdMS_TO_TICKS(150)); // piccolo delay per non saturare la CPU
  }
}
#endif //DONGLE


/////////////////////////////////////////////////////////////////////////////
// FINE VERSIONE GRAFICA RICERCA CANALE PER DONGLE //////////////////////////
/////////////////////////////////////////////////////////////////////////////




// ===============================================================
// ESP-NOW OPTIMAL CHANNEL FINDER - VERSIONE PERFETTA
// Tempo totale: ~14 secondi | Accuratezza: massima
// ===============================================================

// ================= VARIABILI GLOBALI PER CALLBACK =================
static volatile uint32_t g_packetCounter = 0;
static volatile bool g_sniffing = false;

// ================= CALLBACK PROMISCUOUS MODE =================
void IRAM_ATTR promiscuousCallback(void *buf, wifi_promiscuous_pkt_type_t type) {
  if (!g_sniffing) return;
  g_packetCounter = g_packetCounter + 1;
}

// ================= FUNZIONE PRINCIPALE =================
uint8_t findBestChannel() {
  
  #if defined(GUN) && defined(USES_DISPLAY)
  TaskHandle_t animTaskHandle = NULL;  
  //if(display_init) {
  if(display_OLED != nullptr) {
  // Avvio animazione
    if (animTaskHandle == NULL) {
      xTaskCreatePinnedToCore(
        animTask,          // funzione del task
        "AnimTask",        // nome
        4096,              // stack size
        NULL,              // parametri
        1,                 // priorità
        &animTaskHandle,   // handle
        APP_CPU_NUM        // core (puoi usare 0 o 1)
      );
    }
  }
  #endif // USES_DISPLAY
  
  #if defined(DONGLE) && defined(USES_DISPLAY)
  TaskHandle_t animTaskHandle = NULL;  
  if(display_init) {
  // Avvio animazione
    if (animTaskHandle == NULL) {
      xTaskCreatePinnedToCore(
        animTask,          // funzione del task
        "AnimTask",        // nome
        4096,              // stack size
        NULL,              // parametri
        1,                 // priorità
        &animTaskHandle,   // handle
        APP_CPU_NUM        // core (puoi usare 0 o 1)
      );
    }
  }
  #endif // USES_DISPLAY


  // ================= STRUTTURA PER STATISTICHE CANALE =================
  typedef struct {
    uint16_t networks;   // Numero di AP rilevati
    float avgRSSI;       // RSSI medio degli AP
    int8_t maxRSSI;      // RSSI massimo (interferenza più forte)
    uint32_t packets;    // Pacchetti catturati in 600ms
    float noise;         // Stima noise floor
    float score;         // Score base del canale
  } ChannelStats;
  
  ChannelStats channelStats[14];
  memset(channelStats, 0, sizeof(channelStats));
  g_packetCounter = 0;
  g_sniffing = false;
  for (int i = 0; i < 14; i++) channelStats[i].maxRSSI = -128;

  // ================= FASE 1: SCAN RETI WiFi =================
  // Tempo: ~2 secondi (150ms × 13 canali)
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  vTaskDelay(pdMS_TO_TICKS(100));

  // Scan ottimizzato: 150ms per canale cattura tutti i beacon
  // (beacon interval tipico: 100ms)
  int n = WiFi.scanNetworks(false, true, false, 150UL, 0);
  if (n < 0) n = 0;

  if (n > 0) {
    for (int i = 0; i < n; i++) {
      int ch = WiFi.channel(i);
      int rssi = WiFi.RSSI(i);
      if (ch >= 1 && ch <= 13) {
        if (channelStats[ch].networks < 65535) channelStats[ch].networks++;
        channelStats[ch].avgRSSI += rssi;
        if (rssi > channelStats[ch].maxRSSI) {
          channelStats[ch].maxRSSI = (int8_t)rssi;
        }
      }
    }
    
    // Calcola RSSI medio
    for (int ch = 1; ch <= 13; ch++) {
      if (channelStats[ch].networks > 0) {
        channelStats[ch].avgRSSI /= channelStats[ch].networks;
      } else {
        channelStats[ch].maxRSSI = -100; // Canale vuoto
      }
    }
  }
  
