wei134102/OpenFIRE-Firmware-ESP32/shared_lib/OpenFIRE_Wireless/ESP32/OpenFIRE_Wireless.cpp
/*****************************
 *   SERIAL WIRELESS SECTION
 *****************************/

SerialWireless_::operator bool() {
  return true;
}

int SerialWireless_::peek() {
  if (lenBufferSerialRead) {
    return bufferSerialRead[_readerSerialRead];
  }
  return -1;
}

int SerialWireless_::peekBin() {
  if (_readLen) {
    return _queue[_reader];
  }
  return -1;
}

int SerialWireless_::read() {
  if (lenBufferSerialRead) {
    uint8_t ret = bufferSerialRead[_readerSerialRead];
    //lenBufferSerialRead --;
    lenBufferSerialRead = lenBufferSerialRead - 1;
    //_readerSerialRead ++;
    _readerSerialRead = _readerSerialRead + 1;
    if (_readerSerialRead >= FIFO_SIZE_READ_SERIAL) {
      _readerSerialRead -= FIFO_SIZE_READ_SERIAL;
    }
    return ret;
  }
  return -1;  
}

bool SerialWireless_::checkForRxPacket() {
  uint16_t numAvailableBin = _readLen;
  uint8_t dato;
  for (uint16_t i = 0; i<numAvailableBin; i++) {
    dato = (uint8_t) readBin();
    if (dato == START_BYTE) packet.reset(); //resetta inizio pacchetto - // controllo dato .. se è uguale a packet::start_byte .. azzera tutto e fai partire da capo altrimenti
    packet.parse(dato, true);
  }
  return true;
}

int SerialWireless_::readBin() {
  if (_readLen) {
    uint8_t ret = _queue[_reader];
    //_readLen --;
    _readLen = _readLen - 1;
    //_reader ++;
    _reader = _reader + 1;
    if (_reader >= FIFO_SIZE_READ) {
      _reader -= FIFO_SIZE_READ;
    }
    return ret;
  }
  return -1;  
}

int SerialWireless_::available() {
  return lenBufferSerialRead;
}

int SerialWireless_::availableBin() {
  return _readLen;
}

int SerialWireless_::availableForWrite() {
  return FIFO_SIZE_WRITE_SERIAL - lenBufferSerialWrite;
}

int SerialWireless_::availableForWriteBin() {
  return BUFFER_SIZE - _writeLen;
}

// bloccante fino a quando il buffer seriale non è vuoto (non bloccante fino a quando sono stati inviati effettivamente i dati)
void SerialWireless_::flush() {
  esp_timer_stop(timer_handle_serial); // spegni timer
  xSemaphoreTake(mutex_tx_serial, portMAX_DELAY); // prende semaforo / attende finchè è libero
  while (lenBufferSerialWrite) {
    flush_sem();
    taskYIELD(); //yield();
  }
  
  xSemaphoreGive(mutex_tx_serial);  // Rilascio il semaforo dopo la callback
  
}

// decidere se controllare se è vuoto anche il buffer_bin
bool SerialWireless_::flush_sem() { // è bloccante e non esce fino a quando il buffer di uscita è completamente vuoto // in virtual com con TinyUISB non è bloccante .. invia il pacchetto più grande che può e ritorna
  if (lenBufferSerialWrite) {
    if ((BUFFER_SIZE - _writeLen) > (lenBufferSerialWrite + PREAMBLE_SIZE + POSTAMBLE_SIZE)) {
      memcpy(&packet.txBuff[PREAMBLE_SIZE], bufferSerialWrite, lenBufferSerialWrite);
      packet.constructPacket(lenBufferSerialWrite, PACKET_TX::SERIAL_TX);
      writeBin(packet.txBuff, lenBufferSerialWrite + PREAMBLE_SIZE+POSTAMBLE_SIZE);
      lenBufferSerialWrite = 0;
      SendData(); // completata la transizione lasciare solo questo
      return true;
    }
    else SendData();
  }
  return false;
}

void SerialWireless_::flushBin() { // mai usata
  SendData();
}

void SerialWireless_::SendData() {
  if (xSemaphoreTake(tx_sem, 0) == pdTRUE) {
    xSemaphoreTake(mutex_writer_bin, portMAX_DELAY);
    if (_writeLen > 0) {
       SendData_sem();
    } else xSemaphoreGive(tx_sem);
    xSemaphoreGive(mutex_writer_bin);
  }
}

void SerialWireless_::SendData_sem() {
  uint16_t len_tx = _writeLen > ESP_NOW_MAX_DATA_LEN ? ESP_NOW_MAX_DATA_LEN : _writeLen;
  uint16_t bytesToSendEnd = len_tx > (BUFFER_SIZE - readIndex) ? BUFFER_SIZE - readIndex : len_tx;
  memcpy(buffer_espnow, &buffer[readIndex], bytesToSendEnd);
  if (len_tx > bytesToSendEnd) {
    memcpy(&buffer_espnow[bytesToSendEnd], &buffer[0], len_tx - bytesToSendEnd);
  }
  esp_err_t result = esp_now_send(peerAddress, buffer_espnow, len_tx);
  if (result == ESP_OK) { // verificare se esistono casi in cui seppur non risporta ESP_OK vengono trasmessi lo steso
    readIndex += len_tx; 
    if (readIndex >= BUFFER_SIZE) { readIndex -= BUFFER_SIZE; }
    _writeLen -= len_tx;
  }
}

size_t SerialWireless_::write(uint8_t c) {
  return write(&c, 1);
}

size_t SerialWireless_::writeBin(uint8_t c) {
  return writeBin(&c, 1);
}

size_t SerialWireless_::write(const uint8_t *data, size_t len) {
  size_t len_remainer = len;
  size_t pos_remainer = 0;

  xSemaphoreTake(mutex_tx_serial, portMAX_DELAY);
  while (len_remainer > 0) {
    size_t available_space = FIFO_SIZE_WRITE_SERIAL - lenBufferSerialWrite;
    if (available_space >= len_remainer) {
      memcpy(&bufferSerialWrite[lenBufferSerialWrite], &data[pos_remainer], len_remainer);
      if (lenBufferSerialWrite == 0) {
        esp_timer_start_once(timer_handle_serial, TIMER_HANDLE_SERIAL_DURATION_MICROS);
      }
      lenBufferSerialWrite += len_remainer;
      len_remainer = 0;
    } else {
      if (len_remainer == len) esp_timer_stop(timer_handle_serial);
      if (available_space) {
        memcpy(&bufferSerialWrite[lenBufferSerialWrite], &data[pos_remainer], available_space);
        lenBufferSerialWrite = FIFO_SIZE_WRITE_SERIAL;
        pos_remainer += available_space;
        len_remainer -= available_space;
      }
      flush_sem();
    }
    taskYIELD();
  }
  xSemaphoreGive(mutex_tx_serial);
  return len;
}

size_t SerialWireless_::writeBin(const uint8_t *data, size_t len) {
  
  xSemaphoreTake(mutex_writer_bin, portMAX_DELAY);
  
  if ((BUFFER_SIZE - _writeLen) >= len) {
    size_t firstChunk = BUFFER_SIZE - writeIndex;
    if (firstChunk < len) {
      memcpy(&buffer[writeIndex], data, firstChunk);
      writeIndex = len - firstChunk;  
      memcpy(&buffer[0], data + firstChunk, writeIndex);
    }
    else {
      memcpy(&buffer[writeIndex], data, len);
      writeIndex += len;
      if (writeIndex == BUFFER_SIZE) writeIndex = 0;
    }
    _writeLen += len;
    xSemaphoreGive(mutex_writer_bin);
    return len;
  }
  else {
    _overflow_write = true;
    // TODO: gestire overflow
    //Serial.println("Overflow nello scrivere nel BUFFER scrittura");   
    xSemaphoreGive(mutex_writer_bin);
    return 0;
  }
}

